In [3]:
import numpy as np
import pandas as pd

In [ ]:
--- Creating a Data Frame ---

In [4]:
data = {
    'Name': ['Akash', 'Aryan', 'Ashu', 'Gaurav', 'Rahul'],
    'Age': [21, 20, 19, 23, 25],
    'city': ['Ranchi', 'Ramgarh', 'Hazariibag', 'Kolkata', 'Vikash'],
    'Salary': [67000, 70000, 44000, 80000, 70000]
}
df = pd.DataFrame(data)

In [5]:
df

     Name  Age        city  Salary
0   Akash   21      Ranchi   67000
1   Aryan   20     Ramgarh   70000
2    Ashu   19  Hazariibag   44000
3  Gaurav   23     Kolkata   80000
4   Rahul   25      Vikash   70000

In [25]:
data_list = [
    ['Akash', 19, 'Hazaribag', 67000],
    ['Aryan', 20, 'Ramgarh', 65000],
    ['Ashu', 21, 'Ramgarh', 56000],
    ['Rahul', 23, 'vikash', 70000]
]

df2 = pd.DataFrame(data_list)
columns = ['Name', 'Age', 'City', 'Salary']
df2 = pd.DataFrame(data_list, columns = columns)

In [15]:
df2

    Name  Age       City  Salary
0  Akash   19  Hazaribag   67000
1  Aryan   20    Ramgarh   65000
2   Ashu   21    Ramgarh   56000
3  Rahul   23     vikash   70000

In [ ]:
--- Selection and indexing of columns ---

In [26]:
df2

    Name  Age       City  Salary
0  Akash   19  Hazaribag   67000
1  Aryan   20    Ramgarh   65000
2   Ashu   21    Ramgarh   56000
3  Rahul   23     vikash   70000

In [32]:
df2[['Name', 'City']]

    Name       City
0  Akash  Hazaribag
1  Aryan    Ramgarh
2   Ashu    Ramgarh
3  Rahul     vikash

In [ ]:
--- Creating a new Column ---

In [33]:
df2['Designation'] = ['BA', 'BA', 'BCOM', 'ENGINEER']

In [34]:
df2

    Name  Age       City  Salary Designation
0  Akash   19  Hazaribag   67000          BA
1  Aryan   20    Ramgarh   65000          BA
2   Ashu   21    Ramgarh   56000        BCOM
3  Rahul   23     vikash   70000    ENGINEER

In [ ]:
--- Removing Columns ---

In [36]:
df2.drop('Designation', axis = 1)

    Name  Age       City  Salary
0  Akash   19  Hazaribag   67000
1  Aryan   20    Ramgarh   65000
2   Ashu   21    Ramgarh   56000
3  Rahul   23     vikash   70000

In [37]:
df2

    Name  Age       City  Salary Designation
0  Akash   19  Hazaribag   67000          BA
1  Aryan   20    Ramgarh   65000          BA
2   Ashu   21    Ramgarh   56000        BCOM
3  Rahul   23     vikash   70000    ENGINEER

In [38]:
df2.drop('Designation', axis = 1 , inplace = True)

In [39]:
df2

    Name  Age       City  Salary
0  Akash   19  Hazaribag   67000
1  Aryan   20    Ramgarh   65000
2   Ashu   21    Ramgarh   56000
3  Rahul   23     vikash   70000

In [41]:
df2.drop(['City', 'Salary'], axis = 1)

    Name  Age
0  Akash   19
1  Aryan   20
2   Ashu   21
3  Rahul   23

In [42]:
df2

    Name  Age       City  Salary
0  Akash   19  Hazaribag   67000
1  Aryan   20    Ramgarh   65000
2   Ashu   21    Ramgarh   56000
3  Rahul   23     vikash   70000

In [43]:
df2.drop(0, axis = 0)

    Name  Age     City  Salary
1  Aryan   20  Ramgarh   65000
2   Ashu   21  Ramgarh   56000
3  Rahul   23   vikash   70000

In [ ]:
--- Selecting Rows ---

In [44]:
df2

    Name  Age       City  Salary
0  Akash   19  Hazaribag   67000
1  Aryan   20    Ramgarh   65000
2   Ashu   21    Ramgarh   56000
3  Rahul   23     vikash   70000

In [46]:
df2.loc[[0,1]]

    Name  Age       City  Salary
0  Akash   19  Hazaribag   67000
1  Aryan   20    Ramgarh   65000

In [48]:
df2.iloc[3]

Name       Rahul
Age           23
City      vikash
Salary     70000
Name: 3, dtype: object

In [ ]:
--- Selecting subset of rows and columns ---

In [49]:
df2.loc[[0,1]] [['City', 'Salary']]

        City  Salary
0  Hazaribag   67000
1    Ramgarh   65000

In [50]:
df2.loc[[2,3]] [['Name', 'Age']]

    Name  Age
2   Ashu   21
3  Rahul   23

In [ ]:
--- Conditional selection ---

In [51]:
df2

    Name  Age       City  Salary
0  Akash   19  Hazaribag   67000
1  Aryan   20    Ramgarh   65000
2   Ashu   21    Ramgarh   56000
3  Rahul   23     vikash   70000

In [ ]:
# I only want to see these people whose age above 30

In [52]:
df2[df2['Age'] > 20]

    Name  Age     City  Salary
2   Ashu   21  Ramgarh   56000
3  Rahul   23   vikash   70000

In [ ]:
# I only want people whose age is above 30 and their city must be Ramgarh

In [53]:
df2[(df2['Age'] > 20) & (df2['City'] == 'Ramgarh')]

   Name  Age     City  Salary
2  Ashu   21  Ramgarh   56000